In [2]:
import pandas as pd

In [3]:
food = pd.read_csv('food.csv')

In [4]:
food.shape

(50, 6)

In [5]:
food.head()

     Name Gender       City Frequency      Item  Spends
0    Riya      F    Chennai    Weekly     Pasta      25
1  Nitish      F      Delhi   Monthly     Pasta      24
2   Pooja      F     Mumbai     Daily  Sandwich      30
3   Anita      M      Delhi     Daily  Sandwich      27
4   Anita      F  Bangalore     Daily    Burger      13

In [8]:
food.pivot_table(
    index='City',
    columns='Item',
    values='Spends',
    aggfunc='mean'
)

Item       Burger  Fries  Pasta  Pizza   Sandwich
City
Bangalore    20.5   26.0    NaN   16.0   6.000000
Chennai      21.5   24.5   24.0   12.0  16.666667
Delhi         9.0   29.0   26.5    6.0  21.000000
Kolkata      19.0   26.0   16.0   21.0  23.500000
Mumbai       18.0    NaN   20.5   28.0  20.500000

In [9]:
food.pivot_table(
    index=['City','Gender'],
    columns='Item',
    values='Spends',
    aggfunc='mean'
)

Item              Burger  Fries  Pasta      Pizza   Sandwich
City      Gender
Bangalore F         20.5   26.0    NaN  17.500000        NaN
          M          NaN    NaN    NaN  13.000000   6.000000
Chennai   F         25.0   24.5   24.0  12.000000  16.666667
          M         18.0    NaN    NaN        NaN        NaN
Delhi     F          9.0    NaN   26.5   7.000000  11.000000
          M          NaN   29.0    NaN   5.000000  24.333333
Kolkata   F         13.0   26.0   16.0  29.000000  17.000000
          M         25.0    NaN    NaN  18.333333  30.000000
Mumbai    F          NaN    NaN   19.0  28.000000  24.333333
          M         18.0    NaN   25.0        NaN  16.666667

In [10]:
food.pivot_table(
    index=['City','Gender'],
    columns=['Item','Frequency'],
    values='Spends',
    aggfunc='mean'
)

Item             Burger                Fries                  Pasta         \
Frequency         Daily Monthly Weekly Daily Monthly Weekly Monthly Weekly
City      Gender
Bangalore F        20.5     NaN    NaN  26.0     NaN    NaN     NaN    NaN
          M         NaN     NaN    NaN   NaN     NaN    NaN     NaN    NaN
Chennai   F         NaN    25.0    NaN  19.0     NaN   30.0     NaN   24.0
          M         NaN     NaN   18.0   NaN     NaN    NaN     NaN    NaN
Delhi     F         NaN     9.0    NaN   NaN     NaN    NaN    24.0   29.0
          M         NaN     NaN    NaN  29.0     NaN    NaN     NaN    NaN
Kolkata   F        13.0     NaN    NaN   NaN    26.0    NaN     NaN   16.0
          M        25.0     NaN    NaN   NaN     NaN    NaN     NaN    NaN
Mumbai    F         NaN     NaN    NaN   NaN     NaN    NaN    18.0   19.5
          M        18.0     NaN    NaN   NaN     NaN    NaN     NaN   25.0

Item             Pizza                Sandwich
Frequency        Daily Monthly Weekly    Daily Monthly Weekly
City      Gender
Bangalore F        NaN    17.5    NaN      NaN     NaN    NaN
          M       13.0     NaN    NaN      6.0     NaN    NaN
Chennai   F        NaN    12.0    NaN     16.0     NaN   17.0
          M        NaN     NaN    NaN      NaN     NaN    NaN
Delhi     F        7.0     NaN    NaN      NaN    11.0    NaN
          M        NaN     5.0    NaN     27.0    20.0   26.0
Kolkata   F       29.0     NaN    NaN      NaN    17.0    NaN
          M       18.5     NaN   18.0      NaN    30.0    NaN
Mumbai    F        NaN     NaN   28.0     30.0    21.5    NaN
          M        NaN     NaN    NaN     14.0     NaN   22.0